In [3]:
import pandas as pd

In [20]:
# Create dataset from dictionary 
# data = {
#     "ID": [101,102,103,104,105,106,107,108,109,110],
#     "Name": ["Amit","Rahul","Neha","Priya","Karan",
#              "Sneha","Rohit","Anjali","Vikas","Pooja"],
#     "Age": [21,22,20,21,23,22,21,20,24,22],
#     "Department": ["CSE","IT","CSE","ECE","ME",
#                    "IT","CSE","ECE","ME","CSE"],
#     "Marks": [85,78,92,88,67,73,90,81,69,95],
#     "Attendance": [90,85,95,88,76,80,92,87,78,96],
#     "Placement": ["Yes","No","Yes","Yes","No",
#                   "No","Yes","Yes","No","Yes"]
# }
# # Create DataFrame
# df = pd.DataFrame(data)

# # Save as CSV
# df.to_csv("student_data.csv", index=False)

#  creating dataframe from 3 d list 
data = [["Amit",21,10],["Ojha",20,9]]

df = pd.DataFrame(data , columns = [ "Name" , "Age" , "Marks" ]);

df.to_csv("student.csv", index=False)
print("CSV file created successfully!")

CSV file created successfully!

In [4]:
# Read CSV file
df = pd.read_csv("student_data.csv")

# Print complete data
print(df)

    ID    Name  Age Department  Marks  Attendance Placement
0  101    Amit   21        CSE     85          90       Yes
1  102   Rahul   22         IT     78          85        No
2  103    Neha   20        CSE     92          95       Yes
3  104   Priya   21        ECE     88          88       Yes
4  105   Karan   23         ME     67          76        No
5  106   Sneha   22         IT     73          80        No
6  107   Rohit   21        CSE     90          92       Yes
7  108  Anjali   20        ECE     81          87       Yes
8  109   Vikas   24         ME     69          78        No
9  110   Pooja   22        CSE     95          96       Yes

In [21]:
# Read CSV file
df = pd.read_csv("student.csv")

# Print complete data
print(df)

   Name  Age  Marks
0  Amit   21     10
1  Ojha   20      9

In [10]:
#  akhiri 5 rows
df.tail()

    ID    Name  Age Department  Marks  Attendance Placement
5  106   Sneha   22         IT     73          80        No
6  107   Rohit   21        CSE     90          92       Yes
7  108  Anjali   20        ECE     81          87       Yes
8  109   Vikas   24         ME     69          78        No
9  110   Pooja   22        CSE     95          96       Yes

In [11]:
# starting first 5 rows
df.head()

    ID   Name  Age Department  Marks  Attendance Placement
0  101   Amit   21        CSE     85          90       Yes
1  102  Rahul   22         IT     78          85        No
2  103   Neha   20        CSE     92          95       Yes
3  104  Priya   21        ECE     88          88       Yes
4  105  Karan   23         ME     67          76        No

In [12]:
#  remove placement coolumn
df.drop("Placement" , axis=1 , inplace=True)

In [13]:
df

    ID    Name  Age Department  Marks  Attendance
0  101    Amit   21        CSE     85          90
1  102   Rahul   22         IT     78          85
2  103    Neha   20        CSE     92          95
3  104   Priya   21        ECE     88          88
4  105   Karan   23         ME     67          76
5  106   Sneha   22         IT     73          80
6  107   Rohit   21        CSE     90          92
7  108  Anjali   20        ECE     81          87
8  109   Vikas   24         ME     69          78
9  110   Pooja   22        CSE     95          96

In [14]:
#  add placement column
df["Placement"] = ["Yes","No","Yes","Yes","No",
                  "No","Yes","Yes","No","Yes"]

In [15]:
df

    ID    Name  Age Department  Marks  Attendance Placement
0  101    Amit   21        CSE     85          90       Yes
1  102   Rahul   22         IT     78          85        No
2  103    Neha   20        CSE     92          95       Yes
3  104   Priya   21        ECE     88          88       Yes
4  105   Karan   23         ME     67          76        No
5  106   Sneha   22         IT     73          80        No
6  107   Rohit   21        CSE     90          92       Yes
7  108  Anjali   20        ECE     81          87       Yes
8  109   Vikas   24         ME     69          78        No
9  110   Pooja   22        CSE     95          96       Yes

In [16]:
#  for sorting values 
df.sort_values("Marks" , ascending=False)

    ID    Name  Age Department  Marks  Attendance Placement
9  110   Pooja   22        CSE     95          96       Yes
2  103    Neha   20        CSE     92          95       Yes
6  107   Rohit   21        CSE     90          92       Yes
3  104   Priya   21        ECE     88          88       Yes
0  101    Amit   21        CSE     85          90       Yes
7  108  Anjali   20        ECE     81          87       Yes
1  102   Rahul   22         IT     78          85        No
5  106   Sneha   22         IT     73          80        No
8  109   Vikas   24         ME     69          78        No
4  105   Karan   23         ME     67          76        No

In [17]:
# // for filtering 
df[df["Marks"]>90]

    ID   Name  Age Department  Marks  Attendance Placement
2  103   Neha   20        CSE     92          95       Yes
9  110  Pooja   22        CSE     95          96       Yes

In [19]:
#  selecting columns 
df[["Name","Marks"]]

     Name  Marks
0    Amit     85
1   Rahul     78
2    Neha     92
3   Priya     88
4   Karan     67
5   Sneha     73
6   Rohit     90
7  Anjali     81
8   Vikas     69
9   Pooja     95